# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [124]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [125]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [126]:
series = pd.Series(lst)

In [127]:
series

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

In [128]:
print(type(series))

<class 'pandas.core.series.Series'>

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [129]:
series[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [130]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [131]:
df = pd.DataFrame(b)
df.sample(5)

      0     1     2     3     4
2  20.6  73.2  44.2  14.6  91.8
1  61.3  40.8  30.8  37.8  87.6
3  57.4   0.1  96.1   4.2  69.5
7  27.6  26.4  53.8  88.8  68.5
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [132]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [133]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [134]:
df.columns= colnames
df.sample()

   Score_1  Score_2  Score_3  Score_4  Score_5
2     20.6     73.2     44.2     14.6     91.8

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [135]:
subdf = df[['Score_1', 'Score_2']]
subdf.sample()

   Score_1  Score_2
3     57.4      0.1

### 7. From the original data frame, calculate the average Score_3 value.

In [136]:
avg_sc3 = df.Score_3.mean()
print(avg_sc3)

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [137]:
max_sc4 = df.Score_4.max()
print(max_sc4)

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [138]:
median_sc2 = df.Score_2.median()
print(median_sc2)

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [139]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [140]:
df_orders = pd.DataFrame(orders)
df_orders

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [141]:
total_quantity = df_orders.Quantity.sum()
print(total_quantity)

2978

In [142]:
total_revenue = df_orders.Revenue.sum()
print(total_revenue)

637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [143]:
df_orders
df_expensive = df_orders [['Description','UnitPrice']][df_orders.UnitPrice==df_orders['UnitPrice'].max()]
df_lesat_exp = df_orders [['Description','UnitPrice']][df_orders.UnitPrice==df_orders['UnitPrice'].min()]

df_compare = df_expensive.append(df_lesat_exp)
df_compare

                         Description  UnitPrice
6     BOX OF VINTAGE ALPHABET BLOCKS      11.95
3  WORLD WAR 2 GLIDERS ASSTD DESIGNS       0.18

## Let's load another dataset for more exercisesº

In [144]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [145]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [146]:
admissions.isna().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

In [147]:
admissions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 385 entries, 0 to 384
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Serial No.         385 non-null    int64
 1   GRE Score          385 non-null    int64
 2   TOEFL Score        385 non-null    int64
 3   University Rating  385 non-null    int64
 4   SOP                385 non-null    float64
 5   LOR                385 non-null    float64
 6   CGPA               385 non-null    float64
 7   Research           385 non-null    int64
 8   Chance of Admit    385 non-null    float64
dtypes: float64(4), int64(5)
memory usage: 27.2 KB

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [148]:
admissions_new_index = admissions.set_index('Serial No.', drop=False)

In [149]:
admissions_new_index

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92
2,2,316,104,3,3.0,3.5,8.00,1,0.72
3,3,322,110,3,3.5,2.5,8.67,1,0.80
4,4,314,103,2,2.0,3.0,8.21,0,0.65
5,5,330,115,5,4.5,3.0,9.34,1,0.90
...,...,...,...,...,...,...,...,...,...
381,381,324,110,3,3.5,3.5,9.04,1,0.82
382,382,325,107,3,3.0,3.5,9.11,1,0.84
383,383,330,116,4,5.0,4.5,9.45,1,0.91
384,384,312,103,3,3.5,4.0,8.78,0,0.67
385,385,333,117,4,5.0,4.0,9.66,1,0.95

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [150]:
admissions_new_index['GRE Score'].nunique()

49

In [151]:
admissions_new_index['CGPA'].nunique()

168

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [152]:
dfad = admissions_new_index
dfad
dfad[(dfad.Research==1)&(dfad.CGPA >= 9)].shape[1]

9

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [153]:
dfad[(dfad.SOP<3.5)&(dfad.CGPA >= 9)]

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
29,29,338,118,4,3.0,4.5,9.40,1,0.91
63,63,327,114,3,3.0,3.0,9.02,0,0.61
141,141,326,114,3,3.0,3.0,9.11,1,0.83
218,218,324,111,4,3.0,3.0,9.01,1,0.82
240,240,316,99,2,2.5,3.0,9.00,0,0.70
382,382,325,107,3,3.0,3.5,9.11,1,0.84

In [154]:
dfad[(dfad.SOP<3.5)&(dfad.CGPA >= 9)]['Chance of Admit'].mean()

0.785

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [155]:
def tofl_comp(a):
    return a>100

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [156]:
dfad["Decision"]= dfad['TOEFL Score'].apply(tofl_comp)
dfad.sample(10)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Decision
Serial No.,,,,,,,,,,
46,46,327,111,4,3.0,4.0,8.40,1,0.78,True
4,4,314,103,2,2.0,3.0,8.21,0,0.65,True
304,304,300,99,1,1.0,2.5,8.01,0,0.58,False
322,322,319,110,3,3.0,2.5,8.79,0,0.72,True
259,259,299,96,2,1.5,2.0,7.86,0,0.54,False
66,66,328,115,4,4.5,4.0,9.16,1,0.78,True
320,320,319,108,3,3.0,3.5,8.54,1,0.71,True
249,249,312,104,3,3.5,4.0,8.09,0,0.71,True
355,355,301,98,1,2.0,3.0,8.03,1,0.67,False
294,294,323,110,3,4.0,3.5,9.10,1,0.79,True

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [157]:
admissions['decision2'] = np.where(admissions['SOP'] > 3, 1, 0)

In [158]:
admissions

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,decision2
0,1,337,118,4,4.5,4.5,9.65,1,0.92,1
1,2,316,104,3,3.0,3.5,8.00,1,0.72,0
2,3,322,110,3,3.5,2.5,8.67,1,0.80,1
3,4,314,103,2,2.0,3.0,8.21,0,0.65,0
4,5,330,115,5,4.5,3.0,9.34,1,0.90,1
...,...,...,...,...,...,...,...,...,...,...
380,381,324,110,3,3.5,3.5,9.04,1,0.82,1
381,382,325,107,3,3.0,3.5,9.11,1,0.84,0
382,383,330,116,4,5.0,4.5,9.45,1,0.91,1
383,384,312,103,3,3.5,4.0,8.78,0,0.67,1
384,385,333,117,4,5.0,4.0,9.66,1,0.95,1